# # 算术运算符:+ -* / // % **
# print("10 +4=",10+4) #加
# print("10-4=",10-4)#减
# print("10*4=",10*4) #乘
# print("10/4=",10/4)#除-2.5
# print("10//4=",10//4)#|整除(结果为整数)
# print("10%4=",10%4)#取余/求模
# print("10 ** 4=",10 ** 4)#幂指数,10的4次方

#算数运算符的优先级--->  ** ---->  *  /  //  %  ---> +  -

# #案例 :输入两个数 x 和 y,计算 x + y 以及 x - y 的结果并输出
# x = int(input("请输入x的值:"))
# y = int(input("请输入y的值:"))
#
# print("x + y = ",x +y )
# print("x - y = ",x -y )

# x = float(input("请输入x的值:"))
# y = float(input("请输入y的值:"))
#注意: 0.09999999999999998 --->精度损失;由于计算机底层是基于 二进制 进行数据的存储与处理,二进制是无法准确的表示所有的小数,因此涉及到浮点数的运算,可能会去损失精度
# print("x + y = ",x +y )
# print("x - y = ",x -y )
1
#案例一:计算输入三个整数的平均数
# a = float(input("请输入第一个整数:"))
# b = float(input("请输入第二个整数:"))
# c = float(input("请输入第三个整数:"))

# print("三个整数的平均数是:",(a+b+c)/3)

#案例二:要求输入梯形的上底、下底、高，然后计算梯形的面积
# a = float(input("请输入梯形的上底:"))
# b = float(input("请输入梯形的下底:"))
# h = float(input("请输入梯形的高:"))
# print("梯形的面积为:",(a+b)*h/2)

#案例三:要求输入圆的半径，然后计算圆的周长和面积
# r = float(input("请输入圆的半径:"))
# print("圆的周长为:",2*3.14*r)
# print("圆的面积为:",3.14*r**2)

#案例四:身体质量指数BMI的计算（BMI = 质量（kg） /身高（m）²）
# 1.输入体重
# 2.输入身高
# 3.计算身体质量指数BMI并输出
# w = float(input("请输入你的体重(质量（kg）):"))
# l = float(input("请输入你的身高（m）:"))
# print("你的BMI指数为:",w/l**2)

# # # # # # # # # # # # # 赋值运算符: = += -= *= /= %= //= **=
# num = 85
#
# num += 10 # num = num + 10
# print("num += 10 后, num = ", num)
#
# num -= 10 # num = num - 10
# print("num -= 10 后, num = ", num)
#
# num *= 10 # num = num * 10
# print("num *= 10 后, num = ", num)
#
# num /= 10 # num = num / 10
# print("num /= 10 后, num = ", num)
#
# num //= 10 # num = num // 10
# print("num //= 10 后, num = ", num)
#
# num %= 3 # num = num % 3
# print("num %= 3 后, num = ", num)
#
# num **= 3 # num = num ** 3
# print("num **= 3 后, num = ", num)


# # #### # # 比较运算符: == != > >= < <= ####:
# print("100 == 100 吗: ", 100 == 100)
# print("'100' == '100' 吗: ", "100" == "100")
# print("100 != 100 吗: ", 100 != 100)
# print("100 < 100 吗: ", 100 < 100)
# print("100 <= 100 吗: ", 100 <= 100)
# print("100 > 100 吗: ", 100 > 100)
# print("100 >= 100 吗: ", 100 >= 100)


# # # # # # # # # 逻辑运算符: and or not  # # # #
# 案例1:键盘输入一个整数,判断这个数字是否在10-20 之间 -- >在:True,不在:False
n= int(input("请输入一个整数:"))
print(f"{n}在10-20之间:",n>=10 and n <= 20)#and连接的条件是并且的关系,两个条件同时成立(True),结果才是True;否则,就是False
#print(f"{n}在10-20之间:“,10 <= n <= 20)#and连接的条件是并且的关系,两个条件同时成立(True),结果才是True;否则,就是False

# 案例2:键盘输入一个整数,判断这个数字是否不在10-20之间
n =int(input("请输入一个整数:"))
print(f"{n}不在10-20之间:",n<10 or n>20)# or连接的条件,是或者的关系,只要其中有一个成立(True),结果就是True;全部不成立,结果才是False
