# #if条件判断,如果分数超过680,我就去清华读书
# score = 700
# if score > 680:
#     print("欢迎你来清华读书")
#     print("也恭喜你即将踏入精彩的大学生活")
# print("-----------------------------")
#
# #if案例:结合前面学习的输入输出及if条件判断的知识,完成B站登录功能的实现(正确账号和密码为 18888888888/666888)
#
# # 正确的账号和密码
# ok_account = "18888888888"
# ok_password = "666888"
# # 1. 接收用户输入的账号和密码
# account =input("请输入您的B站账号:")
# password = input("请输入您的B站密码:")
# # 2. 判断账号和密码是否全部正确,如果都正确,则登录成功,进入B站首页
# if account == ok_account and password == ok_password:
#     print("登录成功~")
#     print("进入B站首页~")
# # 3. 判断账号和密码是否有错误的,如果有任何一个错误,则登录失败,提示错误信息
# if account != ok_account or password != ok_password:
#     print("登录失败 !")
#     print("账号或密码错误!")
#
#
# #if案例(else优化):结合前面学习的输入输出及if条件判断的知识,完成B站登录功能的实现(正确账号和密码为 18888888888/666888)
#
# # 正确的账号和密码
# ok_account = "18888888888"
# ok_password = "666888"
# # 1. 接收用户输入的账号和密码
# account =input("请输入您的B站账号:")
# password = input("请输入您的B站密码:")
# # 2. 判断账号和密码是否全部正确,如果都正确,则登录成功,进入B站首页
# if account == ok_account and password == ok_password:
#     print("登录成功~")
#     print("进入B站首页~")
# else:
#     print("登录失败 !")
#     print("账号或密码错误!")
#
#案例一:根据用户输入的年份,判断这一年是闰年还是平年。
#非整百年份,且能被4整除的年份是闰年
#整百年份(如1900年、2000年)必须能被400整除才是闰年

# year = int(input("请输入需要判断的年份:"))
#
# #如果非整百年份,且能被4整除的年份是闰年
# if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#     print(f"{year}这个年份是闰年")
# else:
#     print(f"{year}这个年份是平年")


# 案例:三角形类型判断:根据输入的三个边的边长(正整数),判定是等边三角形、等腰三角形、普通三角形,还是不能构成三角形。
#1. 构成三角形的条件:两边之和大于第三边
#2. 三角形判定规则:
#   三个边都相等:等边三角形
#   两个边相等:等腰三角形
#   三个边都不相等:普通三角形

#三角形三个边的边长
a = int(input("第一条边的边长:"))
b = int(input("第二条边的边长:"))
c = int(input("第三条边的边长:"))

#构成三角形的条件
if a + b > c and b + c > a and c + a > b: #条件成立,能构成三角形
    if a==b and b==c:
        print(f"{a},{b},{c} 构成等边三角形")
    elif a==b or b==c or a==c:
        print(f"{a},{b},{c} 构成等腰三角形")
    else:
        print(f"{a},{b},{c} 构成普通三角形")
else:
    print(f"{a},{b},{c} 不构成三角形")


